### NAME: Bùi Phương Thảo
### Class: DSEB63
### ID : 11215341

In [1]:
import pandas as pd
import numpy as np
import regex as re
import random

### 1.DEMOGRAPAHIC dataset

In [2]:
demo = pd.read_csv(r"C:\Users\KyThuat88\Downloads\Sample-Midterm-1-Data\Sample-Midterm-1-Data\demographic.csv")
demo

    age gender                    email address
0  18.0      M                      NaN      HN
1  23.0      F                      NaN      HP
2   NaN      M            abc@gmail.com      BG
3  40.0    NaN  qgiang.nguyen@gmail.com      BN
4  67.0      F                      NaN   TPHCM
5   NaN    NaN         abc@yahoo.com.vn      BD

In [3]:
# 2. The email attribute contains 'abc@gmail.com' values that indicate values are missing, but they aren't represented as NaN. Replace them with NaN value

In [4]:
df = pd.DataFrame(demo['email'])
df

                     email
0                      NaN
1                      NaN
2            abc@gmail.com
3  qgiang.nguyen@gmail.com
4                      NaN
5         abc@yahoo.com.vn

In [5]:
df.replace('^abc@gmail', np.nan, regex = True, inplace = True)

In [6]:
df

                     email
0                      NaN
1                      NaN
2                      NaN
3  qgiang.nguyen@gmail.com
4                      NaN
5         abc@yahoo.com.vn

In [7]:
demo['email'] = df['email']

In [8]:
demo

    age gender                    email address
0  18.0      M                      NaN      HN
1  23.0      F                      NaN      HP
2   NaN      M                      NaN      BG
3  40.0    NaN  qgiang.nguyen@gmail.com      BN
4  67.0      F                      NaN   TPHCM
5   NaN    NaN         abc@yahoo.com.vn      BD

In [9]:
demo['gender'] != np.nan

0    True
1    True
2    True
3    True
4    True
5    True
Name: gender, dtype: bool

In [10]:
#3. Calculate the total number of missing values for each column
demo.isnull().sum()

age        2
gender     2
email      4
address    0
dtype: int64

In [11]:
#4. Add a new column named ‘Total Null’. It should be the total number of nan values of each row
demo['Total null'] = demo.isnull().sum(axis = 1)
demo

    age gender                    email address  Total null
0  18.0      M                      NaN      HN           1
1  23.0      F                      NaN      HP           1
2   NaN      M                      NaN      BG           2
3  40.0    NaN  qgiang.nguyen@gmail.com      BN           1
4  67.0      F                      NaN   TPHCM           1
5   NaN    NaN         abc@yahoo.com.vn      BD           2

In [12]:
demo.shape

(6, 5)

In [13]:
import math

In [14]:
#5. Drop columns that contain more than 80% missing value using the dropna function
demo.dropna(thresh = math.ceil(0.2 * demo.shape[0]),axis = 1, inplace = True)

In [15]:
#6. Drop rows that contain more than two missing values using the dropna function
demo.dropna(thresh = demo.shape[1] - 1, inplace = True)

In [16]:
demo

    age gender                    email address  Total null
0  18.0      M                      NaN      HN           1
1  23.0      F                      NaN      HP           1
3  40.0    NaN  qgiang.nguyen@gmail.com      BN           1
4  67.0      F                      NaN   TPHCM           1

7. Reread this dataset. This time, we will fill the missing values with other values instead of dropping them.
- Fill the missing value of the age attribute by the mean value of this attribute
- Fill the missing value of the gender attribute by the most Frequent Occurring. In the case of having more than one with the highest frequency occurring, randomly choose one between them to fill the missing value.

In [17]:
demo1 = pd.read_csv(r"C:\Users\KyThuat88\Downloads\Sample-Midterm-1-Data\Sample-Midterm-1-Data\demographic.csv")
demo1

    age gender                    email address
0  18.0      M                      NaN      HN
1  23.0      F                      NaN      HP
2   NaN      M            abc@gmail.com      BG
3  40.0    NaN  qgiang.nguyen@gmail.com      BN
4  67.0      F                      NaN   TPHCM
5   NaN    NaN         abc@yahoo.com.vn      BD

In [63]:
demo1[demo1['email'] != np.nan]

    age gender                    email address
0  18.0      M                      NaN      HN
1  23.0      F                      NaN      HP
2  37.0      M            abc@gmail.com      BG
3  40.0      F  qgiang.nguyen@gmail.com      BN
4  67.0      F                      NaN   TPHCM
5  37.0      F         abc@yahoo.com.vn      BD

In [62]:
# demo1['email'] != pd.isnull(demo1['email'])

In [18]:
demo1['age'].fillna(demo1['age'].mean(), inplace = True)

In [19]:
demo1['gender'].fillna(random.choice(list(demo1['gender'].mode())), inplace = True)

In [20]:
demo1

    age gender                    email address
0  18.0      M                      NaN      HN
1  23.0      F                      NaN      HP
2  37.0      M            abc@gmail.com      BG
3  40.0      F  qgiang.nguyen@gmail.com      BN
4  67.0      F                      NaN   TPHCM
5  37.0      F         abc@yahoo.com.vn      BD

### REVENUE dataset

In [21]:
rev = pd.read_csv(r"C:\Users\KyThuat88\Downloads\Sample-Midterm-1-Data\Sample-Midterm-1-Data\revenue.csv")
rev

  CustomerID  Revenue        date
0      R1001       30  2020-12-01
1      W1001     2000  2021-05-01
2      W1001     2200  2021-05-01
3      R1002      150  2021-08-01
4      R1003      270  2020-09-01
5      R1004       50  2021-12-01
6      R1001      100  2021-04-01
7      W1002     5000  2021-09-01

In [22]:
#1.For typing errors, in this dataset, we see that some customers' revenue appears more than once for a specific month. We need to delete one and keep the row with a larger income.
rev[['CustomerID','date']]

  CustomerID        date
0      R1001  2020-12-01
1      W1001  2021-05-01
2      W1001  2021-05-01
3      R1002  2021-08-01
4      R1003  2020-09-01
5      R1004  2021-12-01
6      R1001  2021-04-01
7      W1002  2021-09-01

In [23]:
rev = rev.sort_values('Revenue', ascending = False).drop_duplicates(['CustomerID','date'])

In [24]:
rev

  CustomerID  Revenue        date
7      W1002     5000  2021-09-01
2      W1001     2200  2021-05-01
4      R1003      270  2020-09-01
3      R1002      150  2021-08-01
6      R1001      100  2021-04-01
5      R1004       50  2021-12-01
0      R1001       30  2020-12-01

In [25]:
# 2.In this dataset, we would like to know the latest revenue created by each customer and the time. We would remove rows that contain a CustomerID already listed earlier. Do it using the drop_duplicates method

In [26]:
rev = rev.sort_values('date').drop_duplicates(['CustomerID'])

In [27]:
rev

  CustomerID  Revenue        date
4      R1003      270  2020-09-01
0      R1001       30  2020-12-01
2      W1001     2200  2021-05-01
3      R1002      150  2021-08-01
7      W1002     5000  2021-09-01
5      R1004       50  2021-12-01

In [69]:
rev['month'] = pd.to_datetime(rev['date']).dt.month
rev

  CustomerID  Revenue        date  month
4      R1003      270  2020-09-01      9
0      R1001       30  2020-12-01     12
2      W1001     2200  2021-05-01      5
3      R1002      150  2021-08-01      8
7      W1002     5000  2021-09-01      9
5      R1004       50  2021-12-01     12

In [70]:
rev.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 4 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerID  6 non-null      object
 1   Revenue     6 non-null      int64
 2   date        6 non-null      object
 3   month       6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 240.0+ bytes

### APP.CSV

In [64]:
app = pd.read_csv(r"C:\Users\KyThuat88\Downloads\Sample-Midterm-1-Data\Sample-Midterm-1-Data\apps.csv", encoding = "Latin")
app

  app name    price
0   Latlux   £49.70
1     Span  $12.22
2  Bitwolf   $17,30
3  Sonsing   £10.71
4  Zontrax   ¥48.41

In [65]:
#1. Create a new column named currency whose values are the first character of the price column
app['Currency'] = app['price'].str.strip().str.extract('(\D)')

In [66]:
app

  app name    price Currency
0   Latlux   £49.70        £
1     Span  $12.22         $
2  Bitwolf   $17,30        $
3  Sonsing   £10.71        £
4  Zontrax   ¥48.41        ¥

2. Transform the price column into floating-point number by:
* Deleting the currency characters
* Replacing commas by dots
* Casting the column to float

In [67]:
app['price'] = app['price'].str.extract('(\d+.\d+)')
app

  app name  price Currency
0   Latlux  49.70        £
1     Span  12.22        $
2  Bitwolf  17,30        $
3  Sonsing  10.71        £
4  Zontrax  48.41        ¥

In [68]:
app['price'] = app['price'].str.replace(',','.')
app

  app name  price Currency
0   Latlux  49.70        £
1     Span  12.22        $
2  Bitwolf  17.30        $
3  Sonsing  10.71        £
4  Zontrax  48.41        ¥

In [33]:
app['price'] = app['price'].astype(float)

In [34]:
#3. Make currency column a categorical
app['Currency'] = app['Currency'].astype('category')

In [35]:
app.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   app name  5 non-null      object
 1   price     5 non-null      float64
 2   Currency  5 non-null      category
dtypes: category(1), float64(1), object(1)
memory usage: 345.0+ bytes

In [36]:
test = pd.DataFrame({'ID':['a', 'b', 'ab','a','b'], 'reve':[1000,200, 1800, 800, 400], 'datee': ['mon', 'tues', 'wed', 'mon','tues']})
test

   ID  reve datee
0   a  1000   mon
1   b   200  tues
2  ab  1800   wed
3   a   800   mon
4   b   400  tues

### IV. PEOPLE.CSV

In [37]:
people = pd.read_csv(r"C:\Users\KyThuat88\Downloads\Sample-Midterm-1-Data\Sample-Midterm-1-Data\people.csv")
people

       name  phone number
0   Pernell     389440066
1    Milena   84914208888
2   Terrijo     931999666
3    Carmon     974768936
4  Cornelia   84346663333

In [38]:
#2. Format the phone number column so that each row uses the format 0ddddddddd where d is a digit. For ex: 0389440066 or 0914208888

In [39]:
people['phone number'] = people['phone number'].astype('str').str.extract('([0-9]{9}$)')

In [40]:
people['phone number'] = people['phone number'].apply(lambda x: '0' + str(x))

In [41]:
people

       name phone number
0   Pernell   0389440066
1    Milena   0914208888
2   Terrijo   0931999666
3    Carmon   0974768936
4  Cornelia   0346663333

In [ ]:
#z.fil

### V. BIRTHDAY

In [72]:
birthday = pd.read_csv(r"C:\Users\KyThuat88\Downloads\Sample-Midterm-1-Data\Sample-Midterm-1-Data\birthdays.csv")
birthday

     name adress    birthday
0      An     HN   28.3.2019
1    Hang     QN   5/12/2020
2     Nga     BT   25-Sep-19
3     Anh     TB    3-Jan-19
4  Phuong     ND  03.08.2019

In [43]:
birthday['birthday'] = birthday['birthday'].str.extract(r'(\d+$)')

In [73]:
birthday['birthday'] = birthday['birthday'].apply(lambda x: '20' + str(x) if len(str(x)) == 2 else x)
# cach2 = pd.to_datetime(birthday['birthday']).dt.year
# cach2

0    2019
1    2020
2    2019
3    2019
4    2019
Name: birthday, dtype: int64

In [45]:
birthday['birthday'] = birthday['birthday'].astype('float')

In [46]:
birthday.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      5 non-null      object
 1   adress    5 non-null      object
 2   birthday  5 non-null      float64
dtypes: float64(1), object(2)
memory usage: 248.0+ bytes

### VI. URL dataset

In [47]:
urls = pd.read_csv(r"C:\Users\KyThuat88\Downloads\Sample-Midterm-1-Data\Sample-Midterm-1-Data\urls.csv")
urls

             id                                                url
0  accc1111fa49  https://www.kaggle.com/datasets/teseract/urlda...
1  48ee0ff1ce97                              https://vesta-nf.com/
2  006ff702f8ea                     http://wordpress.com/amet.html
3   7fb76495700                  http://qq.com/lacus/morbi/sem.jpg
4    a8484937dc                       https://www.vndirect.com.vn/

In [48]:
urls['url'].str.contains('^https', regex = True)

0     True
1     True
2    False
3    False
4     True
Name: url, dtype: bool

In [49]:
# Add a secure Boolean column. It should have the value True if the URL starts with HTTPs and False otherwise

In [50]:
urls['Boolean'] = urls['url'].str.contains('^https', regex = True)

In [51]:
urls

             id                                                url  Boolean
0  accc1111fa49  https://www.kaggle.com/datasets/teseract/urlda...     True
1  48ee0ff1ce97                              https://vesta-nf.com/     True
2  006ff702f8ea                     http://wordpress.com/amet.html    False
3   7fb76495700                  http://qq.com/lacus/morbi/sem.jpg    False
4    a8484937dc                       https://www.vndirect.com.vn/     True

In [52]:
#3. Add an extension column. It should have the URL extension( all characters after the last . in the URL). In our case: jpg, html

In [53]:
urls['Extension'] = urls['url'].str.extract('(\.\w+$)') #(?P<extension>....)???

In [54]:
urls

,id,url,Boolean,Extension
0,accc1111fa49,https://www.kaggle.com/datasets/teseract/urlda...,True,NaN
1,48ee0ff1ce97,https://vesta-nf.com/,True,NaN
2,006ff702f8ea,http://wordpress.com/amet.html,False,.html
3,7fb76495700,http://qq.com/lacus/morbi/sem.jpg,False,.jpg
4,a8484937dc,https://www.vndirect.com.vn/,True,NaN